OdDAI.Select.setDoubleArray(OdArray&lt;System.Double,OdObjectsAllocator&lt;System.Double&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with an array of double values.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setHandleArray(OdArray&lt;OdDAIObjectId,OdObjectsAllocator&lt;OdDAIObjectId&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with an array of object identifiers.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setInt32Array(OdArray&lt;System.Int32,OdObjectsAllocator&lt;System.Int32&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with an array of unsigned 32-bit integers.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setLogical(OdDAI.Logical*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with a logical value.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.